# Imports

In [1]:
## Loading libraries
import pandas as pd
import json

# MYSQL
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Loading data
basics=pd.read_csv('/Users/oliver/Desktop/Data/title_basics.csv.gz')
ratings=pd.read_csv('/Users/oliver/Desktop/Data/title_ratings.csv.gz')
results=pd.read_csv('/Users/oliver/Desktop/Project_3/tmdb_results_combined.csv.gz')                 
display(basics.head(),ratings.head(),results.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2191.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.092,180.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,98.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.166,238.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

# Creating Database

In [3]:
# Getting credentials
with open('/Users/oliver/.secret/mysql_credentials.json') as f:
    login=json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [4]:
# Defining database name
db_name='movies'
# Creating connection string, engine, and database
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{db_name}"
# creating engine
engine=create_engine(connection)
# Checking if database exists; create it if not
if database_exists(connection) == False:
  create_database(connection)
else:
  print(f'"{db_name}" already exists.')

In [5]:
df=pd.read_csv('tmdb_results_combined.csv.gz')
df.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2191.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.092,180.0,R

## Getting a List of Unique Genres

In [6]:
# creating a column with a list of all genres by splitting genre strings at ','
basics['genres_split']=basics['genres'].str.split(',')

# using .explode() to get separate lists of genres as new columns
exploded_genres = basics.explode('genres_split')

# saving a list of every entry sorted alphabetically
unique_genres=sorted(exploded_genres['genres_split'].unique())
print(unique_genres)

['Action', 'Adult', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Game-Show', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']

## Creating a new title_genres table

In [7]:
# Creating a new title_genres table from the exploded df
title_genres=exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [8]:
# making a dictionary with list of unique genres as the key and new int id as vals
genre_ints=range(len(unique_genres))
genre_id_map=dict(zip(unique_genres, genre_ints))
print(genre_id_map)

{'Action': 0, 'Adult': 1, 'Adventure': 2, 'Animation': 3, 'Biography': 4, 'Comedy': 5, 'Crime': 6, 'Drama': 7, 'Family': 8, 'Fantasy': 9, 'Game-Show': 10, 'History': 11, 'Horror': 12, 'Music': 13, 'Musical': 14, 'Mystery': 15, 'News': 16, 'Reality-TV': 17, 'Romance': 18, 'Sci-Fi': 19, 'Short': 20, 'Sport': 21, 'Talk-Show': 22, 'Thriller': 23, 'War': 24, 'Western': 25}

In [9]:
# Replacing the string genres in title_genres with the new integer ids.
title_genres['genre_id']=title_genres['genres_split'].replace(genre_id_map)
title_genres=title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [10]:
# Making a dataframe from key-value pairs from genre_id_map
genre_lookup=pd.DataFrame({'genre_name': genre_id_map.keys(),
                          'genre_id': genre_id_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Exporting to Database

## Saving the MySQL tables with tconst as the primary key.

In [11]:
# Gathering needed table data/assigning correct names for 
title_basics=basics[['tconst','primaryTitle','startYear','endYear','runtimeMinutes']]
title_ratings = ratings
# title_genres is fine
genres=genre_lookup
tmbd_data = results[['imdb_id','revenue','budget','certification']]

### Calculating max string lengths for object columns then exporting DataFrames

In [12]:
# basics:
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)
# Adding primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [13]:
# title_ratings:
key_len = title_ratings['tconst'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float(),}

title_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

496788

In [14]:
# title_genres:
key_len = title_genres['tconst'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

161673

In [15]:
# genres:
name_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "'genre_name'":Text(name_len+1), 
    'genre_id':Integer()}
# Adding primary key
genres.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE genres ADD PRIMARY KEY ( genre_id);')

In [16]:
# tmdb_data:
key_len = tmbd_data['imdb_id'].fillna('').map(len).max()
title_len = tmbd_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

tmbd_data.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)
# Adding primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY ( imdb_id);')

# Previewing Tables:

In [17]:
# previewing database:
q = """SHOW TABLES """
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [18]:
# title_basics:
q = """SELECT * 
 FROM title_basics
LIMIT 5; """
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [19]:
# title_ratings:
q = """SELECT * 
 FROM title_ratings
LIMIT 5; """
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1966.0
1  tt0000002            5.8     263.0
2  tt0000005            6.2    2607.0
3  tt0000006            5.2     181.0
4  tt0000007            5.4     816.0

In [20]:
# title_genres
q = """SELECT * 
 FROM title_genres
LIMIT 5; """
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [21]:
# genres:
q = """SELECT * 
 FROM genres
LIMIT 5; """
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [22]:
# tmdb_data:
q = """SELECT * 
 FROM tmdb_data
LIMIT 5; """
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0118589   5271670.0  22000000.0         PG-13
3  tt0118652         0.0   1000000.0             R
4  tt0118694  12855000.0    150000.0            PG